# Lab 1: Pandas Overview

[Pandas](https://pandas.pydata.org/) is one of the most widely used Python libraries in data science. In this lab, you will learn commonly used data tidying operations/tools in Pandas. 

---

#### Objectives

This lab covers the following topics:

* Dataframe basics
     - Creating dataframes
     - Dataframe indexing and attributes
     - Adding, removing, and renaming variables
* Operations on dataframes
     - Slicing (selecting rows and columns)
     - Filtering (selecting rows that meet certain conditions)
* Grouping and aggregation
     - Summary statistics (mean, median, variance, etc.)
     - Grouped summaries
     - Chaining operations and style guidelines
     - Pivoting

**Note**: The Pandas interface is notoriously confusing, and the documentation is not consistently great. Be prepared to search through Pandas documentation and experiment, but remember it is part of the learning experience and will help shape you as a data scientist!

---

### Collaboration

You are encouraged to collaborate with other students on the labs, but are expected to write up your own work for submission. Copying and pasting others' solutions is considered plaigarism and may result in penalties, depending on severity and extent. 

If you choose to work with others, please list their names here.

**Your name:**

**Collaborators:**

___

In [1]:
import numpy as np
import altair as alt
import pandas as pd

## 0. Creating DataFrames & Basic Manipulations

A [dataframe](http://pandas.pydata.org/pandas-docs/stable/dsintro.html#dataframe) is a table in which each column has a type; there is an index over the columns (typically string labels) and an index over the rows (typically ordinal numbers). An index is represented by a _series_ object, which is a one-dimensional labeled array. Here you'll cover:

* creating dataframes from scratch;
* retrieving attributes;
* dataframe indexing;
* adding, removing, and renaming columns.

--- 

### Creating dataframes from scratch

The [documentation](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html) for the pandas `DataFrame` class  provide two primary syntaxes to create a data frame from scratch:

* from a dictionary
* row-wise tuples

**Syntax 1 (dictionary):** You can create a data frame by specifying the columns and values using a dictionary (a concatenation of named lists) as shown below. 

The keys of the dictionary are the column names, and the values of the dictionary are lists containing the row entries.

In [2]:
# define a dataframe using dictionary syntax
fruit_info = pd.DataFrame( 
    data = { 'fruit': ['apple', 'orange', 'banana', 'raspberry'],
             'color': ['red', 'orange', 'yellow', 'pink']
           })

# print
fruit_info

       fruit   color
0      apple     red
1     orange  orange
2     banana  yellow
3  raspberry    pink

**Syntax 2 (row tuples):** You can also define a dataframe by specifying the rows as tuples. 

Each row corresponds to a distinct tuple, and the column indices are specified separately.

In [3]:
# define the same dataframe using tuple syntax 
fruit_info2 = pd.DataFrame(
    [("apple", "red"), ("orange", "orange"), ("banana", "yellow"), ("raspberry", "pink")],
    columns = ["fruit", "color"]
)

# print
fruit_info2

       fruit   color
0      apple     red
1     orange  orange
2     banana  yellow
3  raspberry    pink

---

### Dataframe Attributes

DataFrames have several basic attributes:

* `.shape` contains dimensions;
* `.dtypes` contains data types (float, integer, object, etc.) 
* `.size` first (row) dimension;
* `.values` contains an array comprising each entry in the dataframe.
* `.columns` contains the column index;
* `.index` contains the row index.

You can obtain these attributes by appending the attribute name to the dataframe name. For instance, the dimensions of a dataframe `df` can be retrieved by `df.shape`.

In [4]:
# dimensions
fruit_info.shape

(4, 2)

To retrieve a two-dimensional numpy array with the values of the dataframe, use `df.values`.

In [5]:
# as array
fruit_info.values

array([['apple', 'red'],
       ['orange', 'orange'],
       ['banana', 'yellow'],
       ['raspberry', 'pink']], dtype=object)

---

### Dataframe Indexing

The entries in a dataframe are indexed. Indices for rows and columns are stored as the `.index.` and `.columns` attributes, respectively.

In [6]:
fruit_info.columns

Index(['fruit', 'color'], dtype='object')

In [7]:
fruit_info.index

RangeIndex(start=0, stop=4, step=1)

Notice that the row index is simply a range of consecutive integers from 0 to 4; that is, 0, 1, 2, 3. This is the default behavior when a row index is not specified. We could have added a row index when creating the data frame, such as:

In [8]:
# define with a row index
pd.DataFrame(
    [("apple", "red"), ("orange", "orange"), ("banana", "yellow"), ("raspberry", "pink")],
    columns = ["fruit", "color"],
    index = ["fruit 1", "fruit 2", "fruit 3", 'fruit 4']
)

             fruit   color
fruit 1      apple     red
fruit 2     orange  orange
fruit 3     banana  yellow
fruit 4  raspberry    pink

The elements of the dataframe can be retrived using location `.loc[ROW-INDEX, COL-INDEX]` by specifying index names or by integer location `.iloc[ROW-POSITION, COL-POSITION]` by specifying entry positions.

In [9]:
# retrieve row 0, column 'fruit'
fruit_info.loc[0, 'fruit']

'apple'

In [10]:
# retrieve 0, 0 entry
fruit_info.iloc[0, 0]

'apple'

---
### Adding, removing, and renaming columns

There are two ways to add new columns:

* direct specification;
* using `.loc[]`.

**Direct specification:** For a dataFrame `df`, you can add a column with `df['new column name'] = ...` and assign a list or array of values to the column. 

**Using `.loc[]`**: For a dataframe `df`, you can add a column with `df.loc[:, 'new column name'] = ...` and assign a list or array of values to the column.

Both accomplish the same task -- adding a new column index and populating values for each row -- but `.loc[]` is a little faster.

### Question 0a

Using direct specification, add to the `fruit_info` table a new column called `rank1` containing integers 1, 2, 3, and 4, which express your personal preference about the taste ordering for each fruit (1 is tastiest; 4 is least tasty).

In [11]:
# solution
...

# print
fruit_info

       fruit   color
0      apple     red
1     orange  orange
2     banana  yellow
3  raspberry    pink

### Question 0b

Using `.loc[]`, add a column called `rank2` to the `fruit_info` table, which contains the same values in the same order as the `rank1` column.

In [12]:
# solution
...

# print
fruit_info

       fruit   color
0      apple     red
1     orange  orange
2     banana  yellow
3  raspberry    pink

When using the `.loc[]` approach, the `:` specifies that values are assigned to all rows of the data frame, so the array assigned to the new variable must be the same length as the data frame. What if we only assign values to certain rows? Try running the cell below.

In [13]:
# define new variable just for rows 1 and 2
fruit_info.loc[1:2, 'rank3'] = [1, 2]

# check result
fruit_info

       fruit   color  rank3
0      apple     red    NaN
1     orange  orange    1.0
2     banana  yellow    2.0
3  raspberry    pink    NaN

The remaining rows are assigned missing values. Notice what this does to the data type:

In [14]:
# check data types
fruit_info.dtypes

fruit     object
color     object
rank3    float64
dtype: object

We can detect these missing values using `.isna()`:

In [15]:
# returns a logical data frame indicating whether each entry is missing or not
fruit_info.isna()

   fruit  color  rank3
0  False  False   True
1  False  False  False
2  False  False  False
3  False  False   True

It would be more helpful to simply see by column whether there are missing values. Appending a `.any()` to the above command will do the trick:

In [16]:
# detects whether any column has missing entries
fruit_info.isna().any()

fruit    False
color    False
rank3     True
dtype: bool

Now that we've had a bit of fun let's remove those rank variables. Columns can be removed using `.drop()` with a list of column names to drop as its argument. For example:

In [17]:
# first syntax for .drop()
fruit_info.drop(columns = 'color')

       fruit  rank3
0      apple    NaN
1     orange    1.0
2     banana    2.0
3  raspberry    NaN

There is an alternate syntax to that shown above, which involves specifying the `axis` (row vs. column) and index name to drop:

In [18]:
# second syntax for .drop()
fruit_info.drop('color', axis = 1)

       fruit  rank3
0      apple    NaN
1     orange    1.0
2     banana    2.0
3  raspberry    NaN

### Question 0c

Use the `.drop()` method to drop both the `rank1` and `rank2` columns you created. Note that `drop` **does not change the table**, but instead **returns a new table** with fewer columns or rows. In this case, assign the result to `fruit_info_original`.

*Hint*: Look through the [documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html) (follow the link!) to see how you can drop multiple columns of a Pandas dataframe at once using a list of column names.

*Nifty trick*: Use `df.columns[df.columns.str.startswith('STRING')]` to retrieve all indices starting with `STRING` and `ix.values.tolist()` to convert an index to an array of index names to obtain a list of column names to drop. Combining these gives `df.columns[df.columns.str.startswith('STRING')].values.tolist()`, and will return a list of all column names starting with `STRING`. This can be used in conjunction with the hint to remove all columns starting with `rank`.

In [19]:
# solution 
fruit_info_original = ...

# print
fruit_info_original

Ellipsis

### Question 0d

Review the [documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html) for `.rename()` (follow the link!). Based on the examples, rename the columns of `fruit_info_original` so they begin with capital letters. Set the `inplace` parameter correctly to change the `fruit_info_original` dataframe.

In [20]:
# solution
...

# print
fruit_info_original

Ellipsis

---

## 1. Operations on Data Frames

With some basics in place, here you'll see how to perform subsetting operations on data frames that are useful for tidying up datasets.

* Slicing: selecting columns or rows in chunks or by position.
    - Often imported data contain columns that are either superfluous or not of interest for a particular project.
    - You may also want to examine particular portions of a data frame.
* Filtering: selecting rows that meet certain criteria
    - Often you'll want to remove duplicate rows, filter missing observations, or select a structured subset of a data frame.
    - Also helpful for inspection.

To illustrate these operations, you'll use a dataset comprising counts of the given names of babies born in California each year from 1990 - 2018. The cell below imports the baby names data as a data frame from a .csv file. `.head()` prints the first few rows of the dataset.

In [21]:
# import baby names data
baby_names = pd.read_csv('baby_names.csv')

# preview first few rows
baby_names.head()

  State Sex  Year       Name  Count
0    CA   F  1990    Jessica   6635
1    CA   F  1990     Ashley   4537
2    CA   F  1990  Stephanie   4001
3    CA   F  1990     Amanda   3856
4    CA   F  1990   Jennifer   3611

Your focus here isn't on analyzing this data, so we won't ask you to spend too much effort getting acquainted with it. However, a brief inspection is always a good idea. Let's check:

* dimensions (number of rows and columns);
* how many distinct states, sexes, and years.

### Question 1a

You've already seen how to examine dimensions using dataframe attributes. Check the dimensions of `baby_names`.

In [22]:
# solution
...

You haven't yet seen how to retrieve the distinct values of an array or series. There are a few different ways to go about this, but one is to count the number of occurrences of each distinct entry in a column. This can be done by retrieving the column as a series using syntax of the form `df.colname`, and then pass the result to `.value_counts()`:

In [23]:
# count distinct values
baby_names.Sex.value_counts()

F    112196
M     78566
Name: Sex, dtype: int64

### Question 1b

Count the number of occurences of each distinct year. (If you add `sort = False` as an argument to `value_counts`, the distinct values will be displayed in the order they appear in the dataset.) How many years are represented in the dataset?

In [24]:
# solution
...

---

### Slicing: selecting rows and columns

There are two fast and simple ways to slice dataframes:

* using `.loc` to specify rows and columns by index;
* using `.iloc` to specify rows and columns by position.

You have seen simple examples of both of these above in part 0. Here we'll show how to use these two commands to retrieve multiple rows and columns.

#### Slicing with `.loc`: specifying index names

This method retrieves entries by specifying row and column indexes using syntax of the form `df.loc[rows, cols]`. The rows and columns can be single indices, a list of indices, or a set of adjacent indices using a colon `:`. Examples of these usages are shown below.

In [25]:
# single indices -- small slice
baby_names.loc[2, 'Name']

'Stephanie'

In [26]:
# a list of indices -- larger slice
baby_names.loc[[2, 3], ['Name', 'Count']]

        Name  Count
2  Stephanie   4001
3     Amanda   3856

In [27]:
# consecutive indices -- a chunk
baby_names.loc[2:10, 'Year':'Count']

    Year       Name  Count
2   1990  Stephanie   4001
3   1990     Amanda   3856
4   1990   Jennifer   3611
5   1990  Elizabeth   3170
6   1990      Sarah   2843
7   1990   Brittany   2737
8   1990   Samantha   2720
9   1990   Michelle   2453
10  1990    Melissa   2442

### Slicing with `.iloc`: specifying entry positions

An alternative to specifying the indices in order to slice a dataframe is to specify the entry positions using `.iloc` ('**i**nteger **loc**ation'). You have seen an example of this too. As with `.loc`, `.iloc` can be used to select multiple rows/columns using either lists of positions or a consecutive set with `from:to` syntax.

In [28]:
# single position
baby_names.iloc[2, 3]

'Stephanie'

In [29]:
# a list of positions
baby_names.iloc[[2, 3], [3, 4]]

        Name  Count
2  Stephanie   4001
3     Amanda   3856

In [30]:
# consecutive positions
baby_names.iloc[2:11, 2:5]

    Year       Name  Count
2   1990  Stephanie   4001
3   1990     Amanda   3856
4   1990   Jennifer   3611
5   1990  Elizabeth   3170
6   1990      Sarah   2843
7   1990   Brittany   2737
8   1990   Samantha   2720
9   1990   Michelle   2453
10  1990    Melissa   2442

While these syntaxes may look very similar to `.loc`, there are some subtle but important differences. In particular, the row specification looks roughly the same, but it is not.

Sorting the `baby_names` dataframe helps to reveal how the *position* of a row is not necessarily equal to the *index* of a row. For example, the first row is not necessarily the row associated with index 1. This distinction is important in understanding the difference between `.loc[]` and `.iloc[]`.

In [31]:
# sort and display
sorted_baby_names = baby_names.sort_values(by=['Name'])
sorted_baby_names.head()

       State Sex  Year   Name  Count
160797    CA   M  2008  Aadan      7
178791    CA   M  2014  Aadan      5
163914    CA   M  2009  Aadan      6
171112    CA   M  2012  Aaden     38
179928    CA   M  2015  Aaden     34

Here is an example of how we would get the 2nd, 3rd, and 4th rows with only the `Name` column of the `baby_names` dataframe using both `iloc[]` and `loc[]`. Observe the difference, especially after sorting `baby_names` by name.

In [32]:
# example iloc usage
sorted_baby_names.iloc[1:4, 3]

178791    Aadan
163914    Aadan
171112    Aaden
Name: Name, dtype: object

Notice that using `loc[]` with 1:4 gives different results, since it selects using the *index*. The *index* gets moved around when you perform an operation like `sort` on the dataframe.

In [33]:
# same syntax, different result
sorted_baby_names.loc[1:4, "Name"]

1           Ashley
22219       Ashley
138598      Ashley
151978      Ashley
120624      Ashley
            ...
74380       Jennie
19395       Jennie
23061       Jennie
91825       Jennie
4         Jennifer
Name: Name, Length: 68640, dtype: object

Above, the `.loc` method retrieves all indexes between index 1 and index 4 *in the order they appear in the sorted dataset*. If instead we want to retrieve the same rows returned by the `.iloc` command, we need to specify the row indices explicitly as a list:

In [34]:
# retrieve the same rows as iloc using loc
sorted_baby_names.loc[[178791, 163914, 171112], 'Name']

178791    Aadan
163914    Aadan
171112    Aaden
Name: Name, dtype: object

Sometimes it's useful for slicing (and other operations) to set one of the columns to be a row index. This can be accomplished using `set_index`.

In [35]:
# change the (row) index from 0,1,2,... to the name column
baby_names_nameindexed = baby_names.set_index("Name") 
baby_names_nameindexed.head()

          State Sex  Year  Count
Name
Jessica      CA   F  1990   6635
Ashley       CA   F  1990   4537
Stephanie    CA   F  1990   4001
Amanda       CA   F  1990   3856
Jennifer     CA   F  1990   3611

We can now slice by name directly:

In [36]:
# slice rows for ashley and jennifer
baby_names_nameindexed.loc[['Ashley', 'Jennifer'], :]

         State Sex  Year  Count
Name
Ashley      CA   F  1990   4537
Ashley      CA   F  1991   4233
Ashley      CA   F  1992   3966
Ashley      CA   F  1993   3591
Ashley      CA   F  1994   3202
...        ...  ..   ...    ...
Jennifer    CA   M  1998     10
Jennifer    CA   M  1999     12
Jennifer    CA   M  2000     10
Jennifer    CA   M  2001      8
Jennifer    CA   M  2002      7

[88 rows x 4 columns]

### Question 1c

Look up your name or the name of a friend! Use the name-indexed data frame to slice rows for the name of your choice and the `Count`, `Sex`, and `Year` columns **in that order**.

In [37]:
# solution
...

## Filtering

Filtering is sifting out rows according to a criterion, and can be accomplished using an array or series of `True`s and `False`s defined by a comparison. To take a simple example, say you wanted to filter out all names with fewer than 1000 occurrences. First you could define a logical series:

In [38]:
# true if filtering criterion is met, false otherwise
arr = baby_names.Count > 1000

Then you can filter using that array:

In [39]:
# filter
baby_names_filtered = baby_names[arr]
baby_names_filtered.head()

  State Sex  Year       Name  Count
0    CA   F  1990    Jessica   6635
1    CA   F  1990     Ashley   4537
2    CA   F  1990  Stephanie   4001
3    CA   F  1990     Amanda   3856
4    CA   F  1990   Jennifer   3611

Notice that the filtered array is much smaller than the overall array -- only about 2000 rows correspond to a name occurring more than 1000 times in a year for a gender.

In [40]:
# compare dimensions
print(baby_names_filtered.shape)
print(baby_names.shape)

(2517, 5)
(190762, 5)

You have already encountered this concept in lab 0 when subsetting an array. For your reference, some commonly used comparison operators are given below.


Symbol | Usage      | Meaning 
------ | ---------- | -------------------
`==`   | `a == b`   | Does a equal b?
`<=`   | `a <= b`   | Is a less than or equal to b?
`>=`   | `a >= b`   | Is a greater than or equal to b?
`<`    | `a < b`    | Is a less than b?
`>`    | `a > b`    | Is a greater than b?
`~`    | `~p`       | Returns negation of p
 <code>&#124;</code>    | `p`  <code>&#124;</code> `q` | p OR q
`&`    | `p & q`    | p AND q
`^`    | `p ^ q` | p XOR q (exclusive or)

What if instead you wanted to filter using multiple conditions? Here's an example of retrieving rows with counts exceeding 1000 for only the year 2001:

In [41]:
# filter using two conditions
baby_names[(baby_names.Year == 2000) & (baby_names.Count > 1000)]

       State Sex  Year      Name  Count
36416     CA   F  2000     Emily   2958
36417     CA   F  2000    Ashley   2831
36418     CA   F  2000  Samantha   2579
36419     CA   F  2000   Jessica   2484
36420     CA   F  2000  Jennifer   2263
...      ...  ..   ...       ...    ...
137298    CA   M  2000     Oscar   1089
137299    CA   M  2000    Thomas   1061
137300    CA   M  2000   Cameron   1052
137301    CA   M  2000    Austin   1010
137302    CA   M  2000   Richard   1001

[98 rows x 5 columns]

### Question 1d

Select the girl names in 2010 that have larger than 3000 counts. 

Note: Any time you use `p & q` to filter the dataframe, make sure to use `df[df[(p) & (q)]]` or `df.loc[df[(p) & (q)]])`. That is, make sure to wrap conditions with parentheses.

In [42]:
# solution
...

---
## 2. Grouping and aggregation

Grouping and aggregation are useful in generating data summaries, which are often important starting points in exploring a dataset.


### Aggregation

**Aggregation** literally means 'putting together' (etymologically the word means 'joining the herd') -- in statistics and data science, this refers to data summaries like an average, a minimum, or a measure of spread such as the sample variance or mean absolute deviation (data herding!). From a technical point of view, operations that take multiple values as inputs and return a single output are considered summaries -- in other words, statistics. Some of the most common aggregations are:

* sum
* product
* count
* number of distinct values
* mean
* median
* variance
* standard deviation
* minimum/maximum
* quantiles

Pandas has built-in dataframe operations that compute most of these summaries across either axis (column-wise or row-wise):

* `.sum()`
* `.prod()`
* `.mean()`
* `.median()`
* `.var()`
* `.std()`
* `.nunique()`
* `.min()` and `.max()`
* `.quantile()`

To illustrate these operations, let's filter out all names in 1995.

In [43]:
# filter 1995 names
names_95 = baby_names[baby_names.Year == 1995]

How many individuals were counted in total in 1995? We can address that by computing a sum of the counts:

In [44]:
# n for 1995
names_95.Count.sum()

494580

What is the typical frequency of all names in 1995? We can address that by computing the average count:

In [45]:
# average count for a name in 1995
names_95.Count.mean()

81.18516086671043

### Question 2a

Compute the maximum count of names given in 1995. Use this value to filter `names_95` and find which name is the most frequent in that year.

In [46]:
# solution
...

**Caution!** If applied to the entirer dataframe, the operation `df.max()` (or any other aggregation) will return the maximum *of each column*. Notice that the cell below does not return the row you found in Q2a, but could easily be misinterpreted as such. The cell **does** tell you that the maximum value of sex (alphabetically last) is M and the maximum name (alphabetically last) is Zyanya and the maximum count is 5003; it **does not** tell you that 5003 boys were named Zyanya in 1995.

In [47]:
# maximum of each variable
names_95.max()

State        CA
Sex           M
Year       1995
Name     Zyanya
Count      5003
dtype: object

---

### Grouping

What if you want to know the most frequent male and female names? That is an example where it would be useful to **group** the rows by sex and then perform operations group-wise.

In general, any variable in a dataframe can be used to define a grouping structure on the rows (or, less common, columns). After grouping, any dataframe operations will be executed within each group, but not across groups. This can be used to generate grouped summaries, such as the maximum count for boys and girls; as a point of terminology, we'd describe this summary as 'maximum count by sex' (SUMMARY by GROUPING VARIABLE).

The `.groupby()` function defines such a structure; here is the [documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html). The cell below groups the `names_95` dataframe by sex. Notice that when the grouped dataframe is previewed with `.head()`, the first few rows are returned *for each group*.

In [48]:
# grouped dataframe
names_95_bysex = names_95.groupby('Sex')

# print
names_95_bysex.head(2)

       State Sex  Year     Name  Count
18604     CA   F  1995  Jessica   4620
18605     CA   F  1995   Ashley   2903
124938    CA   M  1995   Daniel   5003
124939    CA   M  1995  Michael   4783

Now any aggregation operations applied to the grouped dataframe will be applied separately to the rows where `Sex == M` and the rows where `Sex == F`. For example, computing `.sum()` on the grouped dataframe will show the total number of individuals in the data for 1995 *by sex*:

In [49]:
# number of individuals by sex
names_95_bysex.Count.sum()

Sex
F    234552
M    260028
Name: Count, dtype: int64

The most frequent boy and girl names can be found using `.idxmax()` groupwise to obtain the index of the first occurence of the maximum count for each sex, and then slicing with `.loc`:

In [50]:
# first most common names by sex
names_95.loc[names_95_bysex.Count.idxmax(), :]

       State Sex  Year     Name  Count
18604     CA   F  1995  Jessica   4620
124938    CA   M  1995   Daniel   5003

Since `.idxmax()` gives the index of the *first* occurrence, these are the alphabetically first most common names; there could be ties. You know from Q2a that there are no ties for the male names; another filtering step can be used to check for ties among the female names.

In [51]:
# ties?
names_95[names_95_bysex.Count.max().values[0] == names_95['Count']]

      State Sex  Year     Name  Count
18604    CA   F  1995  Jessica   4620

So, no ties.

### Question 2b

Are there more girl names or boy names in 1995? Use the grouped dataframe `names_95_bysex` with the `.count()` aggregation to find the total number of names for each sex.

In [52]:
# solution
...

---

### Chaining operations

You have already seen examples of this, but pandas and numpy operations can be chained together in sequence. For example, `names_95.Count.max()` is a chain with two steps: first select the `Count` column; then compute the maximum. Grouped summaries are often convenient to compute in a chained fashion, rather than by assigning the grouped dataframe a new name and performing operations on that.

For example, finding the total number of boys and girls recorded in the 1995 data can be done with the following chain:

In [53]:
# repeating previous calculation, more streamlined
names_95.groupby('Sex').Count.sum()

Sex
F    234552
M    260028
Name: Count, dtype: int64

We can take this even one step further and also perform the filtering in sequence as part of the chain:

In [54]:
# longer chain
baby_names[baby_names.Year == 1995].groupby('Sex').Count.sum()

Sex
F    234552
M    260028
Name: Count, dtype: int64

Chains can get somewhat long, but they have the advantage of making codes more efficient, and often more readable. We did above in one step what took several lines before. Further, this chain can almost be read aloud:

"Take baby names, filter on year, *then* group by sex, *then* select name counts, *then* compute the sum."

Let's now consider computing the average counts of boy and girl names for each year 1990-1995. This can be accomplished by the following chain (notice it is possible to group by multiple variables).

In [55]:
# average counts by sex and year
baby_names[baby_names.Year <= 1995].groupby(['Year', 'Sex']).mean()

               Count
Year Sex
1990 F     70.085760
     M    115.231930
1991 F     70.380888
     M    114.608124
1992 F     68.744510
     M    110.601556
1993 F     66.330675
     M    107.896552
1994 F     66.426301
     M    102.967966
1995 F     64.900941
     M    104.934625

This display is not ideal. We can 'pivot' the table into a wide format by adding a few extra steps in the chain: change the indices to columns; then define a new shape by specifying which column should be the new row index, which should be the new column index, and which values should populate the table.

In [56]:
# average counts by sex and year
baby_names[baby_names.Year <= 1995].groupby(['Year', 'Sex']).mean().reset_index().pivot(index = 'Sex', columns = 'Year', values = 'Count')

Year       1990        1991        1992        1993        1994        1995
Sex
F      70.08576   70.380888   68.744510   66.330675   66.426301   64.900941
M     115.23193  114.608124  110.601556  107.896552  102.967966  104.934625

**Style comment: break long chains over multiple lines with indentation.** The above chain is too long to be readable. To balance the readability of codes with the efficiency of chaining, it is good practice to break long chains over several lines, with appropriate indentations. Here is a better-styled version of the previous cell:

In [57]:
# better style
baby_names[baby_names.Year <= 1995].groupby(
    ['Year', 'Sex']).mean(
).reset_index(
).pivot(
    index = 'Sex', 
    columns = 'Year', 
    values = 'Count'
)

Year       1990        1991        1992        1993        1994        1995
Sex
F      70.08576   70.380888   68.744510   66.330675   66.426301   64.900941
M     115.23193  114.608124  110.601556  107.896552  102.967966  104.934625

Here are some rules of thumb on style.

* Separate comparisons by spaces (`a<b` as `a < b`)
* Split chains longer than 30-40 characters over multiple lines
* Split lines between delimiters `(`, `)`
* Increase indentation for lines between delimiters
* For chained operations, try to get each step in the chain shown on a separate line
* For functions with multiple arguments, split lines so that each argument is on its own line

### Question 2c

Write a chain with appropriate style to display the (first) most common boy and girl names in each of the years 2005-2015. Do this in two steps:

1. First filter `baby_names` by year, then group by year and sex, and then find the indices of first occurence of the largest counts. Store these indices as `ind`.
2. Then use `.loc[]` with your stored indices to slice `baby_names` so as to retrieve the rows corresponding to each most frequent name each year and for each sex; then pivot this table so that the columns are years, the rows are sexes, and the entries are names.

In [58]:
# solution
ind = ...

...

Ellipsis

---
## Submission Checklist
1. Save file to confirm all changes are on disk
2. Run *Kernel > Restart & Run All* to execute all code from top to bottom
3. Save file again to write any new output to disk
4. Select *File > Download* (should save as .ipynb)
5. Submit to Gradescope